Terraform plan for __production__
<details>
  <summary>Plan: 18 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_dns_record_set.inventory_postgres_a_record will be created
  + resource "google_dns_record_set" "inventory_postgres_a_record" {
      + id           = (known after apply)
      + managed_zone = "ebo-prod-private-dns-managed-zone"
      + name         = "inventory.postgres.commerce.internal."
      + project      = "ebo-prod"
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.inventory_redis_a_record will be created
  + resource "google_dns_record_set" "inventory_redis_a_record" {
      + id           = (known after apply)
      + managed_zone = "ebo-prod-private-dns-managed-zone"
      + name         = "inventory.redis.commerce.internal."
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

  # kubernetes_secret.inventory_app_secret will be created
  + resource "kubernetes_secret" "inventory_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "inventory-db-secrets"
          + namespace        = "inventory"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.inventory_postgres_name_postfix will be created
  + resource "random_id" "inventory_postgres_name_postfix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_string.dev_team_db_password will be created
  + resource "random_string" "dev_team_db_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.inventory_app_user_name will be created
  + resource "random_string" "inventory_app_user_name" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.inventory_app_user_password will be created
  + resource "random_string" "inventory_app_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.inventory_password will be created
  + resource "random_string" "inventory_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["inventory-qa"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "inventory-qa"
      + project   = "ebo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.default[0] will be created
  + resource "google_sql_database" "default" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "inventory"
      + project   = "ebo-prod"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_13"
      + deletion_protection           = false
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = "ebo-prod"
      + public_ip_address             = (known after apply)
      + region                        = "asia-south1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = "ALWAYS"
          + authorized_gae_applications = (known after apply)
          + availability_type           = "REGIONAL"
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = false
          + disk_autoresize_limit       = 0
          + disk_size                   = 20
          + disk_type                   = "PD_SSD"
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-custom-1-3840"
          + user_labels                 = {
              + "env"     = "production"
              + "project" = "ebo-prod"
            }
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = false
              + enabled                        = false
              + point_in_time_recovery_enabled = false
              + start_time                     = "22:00"
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = 30
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/ebo-prod/global/networks/ebo-prod-network"
              + require_ssl     = false
            }

          + location_preference {
              + zone = "asia-south1-a"
            }

          + maintenance_window {
              + day          = 1
              + hour         = 23
              + update_track = "stable"
            }
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
          + update = "15m"
        }
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["dev-read-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "dev-read-user"
      + password = (sensitive value)
      + project  = "ebo-prod"
    }

  # module.inventory_google_postgres.google_sql_user.default[0] will be created
  + resource "google_sql_user" "default" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = (known after apply)
      + password = (sensitive value)
      + project  = "ebo-prod"
    }

  # module.inventory_google_postgres.null_resource.module_depends_on will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "0"
        }
    }

  # module.inventory_google_postgres.random_id.additional_passwords["dev-read-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_google_postgres.random_id.suffix[0] will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.inventory_google_postgres.random_id.user-password will be created
  + resource "random_id" "user-password" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
    }

  # module.inventory_redis.google_redis_instance.cache will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = false
      + auth_string              = (sensitive value)
      + authorized_network       = "https://www.googleapis.com/compute/v1/projects/ebo-prod/global/networks/ebo-prod-network"
      + connect_mode             = "DIRECT_PEERING"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + host                     = (known after apply)
      + id                       = (known after apply)
      + location_id              = (known after apply)
      + memory_size_gb           = 2
      + name                     = "inventory-redis"
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = (known after apply)
      + redis_version            = "REDIS_5_0"
      + region                   = "asia-south1"
      + reserved_ip_range        = "10.100.0.0/24"
      + server_ca_certs          = (known after apply)
      + tier                     = "BASIC"
      + transit_encryption_mode  = "DISABLED"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #173](https://github.com/ebomart/commerce-infrastructure/actions/runs/1256926201)